char* str1 = "Hello";

char str2[6] = "Hello";  // H e l l o + '/0'
// еквивалентно
char str2[6] = {'H', 'e', 'l', 'l', 'o', '\0'};

// str1 - е указател, не е масив, сочи към място на което е записан низът
// "Hello";

// за разлика от str1
// str2 - е масив (с размер 6), който е инициализан с низът "Hello".

// str1 НЕ МОЖЕМ да го модифицираме!!! Недефинирано поведение
// заради това е препоръчително да пишем:
const char* str1 = "Hello";
// str2 МОЖЕМ да го модифицираме.

#include <iostream>

int main() {
  char* p = "Hello";

  p[3] = 'Z';  // UB

  return 0;
}
